If the fabrication dimension is modifiable by user.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public bool IsModifiable { get; }
  Visual Basic
Public ReadOnly Property IsModifiable As Boolean
	Get
  Visual C++
public:
property bool IsModifiable {
	bool get ();
}
 See Also
  FabricationDimensionDefinition Class
  Autodesk.Revit.DB Namespace